In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('ComputerSales.csv')

In [4]:
df.head()

,Sale ID,Contact,Sex,Age,State,Product ID,Product Type,Sale Price,Profit,Lead,Month,Year
0,1,Paul Thomas,M,43,OH,M01-F0024,Desktop,479.99,143.39,Website,January,2018
1,2,Margo Simms,F,37,WV,GT13-0024,Desktop,1249.99,230.89,Flyer 4,January,2018
2,3,Sam Stine,M,26,PA,I3670,Desktop,649.99,118.64,Website,February,2018
3,4,Moe Eggert,M,35,PA,I3593,Laptop,399.99,72.09,Website,March,2018
4,5,Jessica Elk,F,55,PA,15M-ED,Laptop,699.99,98.09,Flyer 4,March,2018

In [5]:
df.describe()

         Sale ID        Age   Sale Price      Profit         Year
count  39.000000  39.000000    39.000000   39.000000    39.000000
mean   20.000000  45.666667   837.169487  139.974615  2018.871795
std    11.401754   9.820315   342.229138   44.746575     0.800641
min     1.000000  23.000000   399.990000   72.090000  2018.000000
25%    10.500000  43.000000   564.990000  118.640000  2018.000000
50%    20.000000  46.000000   699.990000  143.090000  2019.000000
75%    29.500000  53.000000  1149.990000  163.515000  2019.500000
max    39.000000  57.000000  1349.990000  230.890000  2020.000000

In [11]:
df.isna().sum()

Sale ID         0
Contact         0
Sex             0
Age             0
State           0
Product ID      0
Product Type    0
Sale Price      0
Profit          0
Lead            0
Month           0
Year            0
dtype: int64

In [13]:
df.columns

Index(['Sale ID', 'Contact', 'Sex', 'Age', 'State', 'Product ID',
       'Product Type', 'Sale Price', 'Profit', 'Lead', 'Month', 'Year'],
      dtype='object')

In [15]:
df['Profit'].mean()

139.97461538461545

In [17]:
# get the product with the highest profit
df[['Product ID', 'Profit']].max(axis=0).head() # axis=0=rows

Product ID    Q526FA
Profit        230.89
dtype: object

In [19]:
# number of people who made purchases from west virginia WV
# get state == wv, and return data only from state
df[df['State'] == 'WV']['State'].count()

4

In [22]:
# number of purchases in 2019
df[df['Year'] == 2019]['Year'].count()

14

In [23]:
# number of purchases in 2019
len(df[df['Year'] == 2019].index)

14

In [31]:
# number of sales for each product type

group_product = df.groupby('Product Type')
group_product.count()['Sale ID']

Product Type
Desktop    12
Laptop     23
Tablet      4
Name: Sale ID, dtype: int64

In [32]:
df['Product ID'].value_counts()

GA401IV      6
M01-F0024    5
81TC00       5
I3593        5
GT13-0024    4
MY2J2LL      4
15M-ED       4
I3670        3
Q526FA       3
Name: Product ID, dtype: int64

In [33]:
group_product = df.groupby('Product ID')
group_product.count()['Sale ID']

Product ID
15M-ED       4
81TC00       5
GA401IV      6
GT13-0024    4
I3593        5
I3670        3
M01-F0024    5
MY2J2LL      4
Q526FA       3
Name: Sale ID, dtype: int64

In [34]:
df[df['Product ID'] == 'M01-F0024']['Contact']

0     Paul Thomas
9      Phil Jones
20     Jason Case
29     Phil Jones
36     Jason Case
Name: Contact, dtype: object

In [41]:
# how many Lead website profit over 200
df[(df['Lead'] == 'Website') & (df['Profit'] > 150)]['Lead'].count()

2

In [45]:
# checking cents from value. that ends with 89
df['Profit'].apply(lambda cents : str(cents).split('.')[1] == '89').value_counts()

False    35
True      4
Name: Profit, dtype: int64